Analyzing input.txt
{"text": " 




Unit 3
Electrochemistry





Chemical reactions can be used to produce electrical energy, conversely, electrical energy can be used to carry out chemical reactions that do not proceed spontaneously.", "fibs": ["Unit"]}
{"text": "Objectives



After studying this Unit, you will be able to







describe an electrochemical cell and differentiate between galvanic and electrolytic cells;
apply Nernst equation for calculating the emf of galvanic cell and define standard potential of the cell;
derive relation between standard potential of the cell, Gibbs energy of cell reaction and its equilibrium constant;
define resistivity (ρ), conductivity (κ) and molar conductivity (^m) of ionic solutions;
differentiate between ionic (electrolytic) and electronic conductivity;
describe the method for measurement of conductivity of electrolytic solutions and calculation of their molar conductivity;
justify the variation of conductivity and molar conductivity of solutions with change in their concentration and define (molar conductivity at zero concentration or infinite dilution);
enunciate Kohlrausch law and learn its applications;
understand quantitative aspects of electrolysis;
describe the construction of some primary and secondary batteries and fuel cells;
explain corrosion as an electrochemical process.", "fibs": ["Unit"]}
{"text": "Electrochemistry is the study of production of electricity from energy released during spontaneous chemical reactions and the use of electrical energy to bring about non-spontaneous chemical transformations.", "fibs": ["study"]}
{"text": "The subject is of importance both for theoretical and practical considerations.", "fibs": ["subject"]}
{"text": "A large number of metals, sodium hydroxide, chlorine, fluorine and many other chemicals are produced by electrochemical methods.", "fibs": ["number"]}
{"text": "Batteries and fuel cells convert chemical energy into electrical energy and are used on a large scale in various instruments and devices.", "fibs": ["fuel"]}
{"text": "The reactions carried out electrochemically can be energy efficient and less polluting.", "fibs": ["energy"]}
{"text": "Therefore, study of electrochemistry is important for creating new technologies that are ecofriendly.", "fibs": ["study"]}
{"text": "The transmission of sensory signals through cells to brain and vice versa and communication between the cells are known to have electrochemical origin.", "fibs": ["transmission"]}
{"text": "Electrochemistry, is therefore, a very vast and interdisciplinary subject.", "fibs": ["interdisciplinary"]}
{"text": "In this Unit, we will cover only some of its important elementary aspects.", "fibs": ["Unit"]}
{"text": "3.1 Electrochemical Cells
In Class XI, Unit 8, we had studied the construction and functioning of Daniell cell (Fig.", "fibs": ["XI"]}
{"text": "This cell converts the chemical energy liberated during the redox reaction
Zn(s) + Cu2+­­­(aq) → Zn2+(aq) + Cu(s)                                                     (3.1)
to electrical energy and has an electrical potential equal to 1.1 V when concentration of Zn2+ and Cu2+ ions is unity (1 mol dm–3)*.", "fibs": ["cell"]}
{"text": "Such a device is called a galvanic or a voltaic cell.", "fibs": ["device"]}
{"text": "Fig.", "fibs": ["Fig"]}
{"text": "3.1: Daniell cell having electrodes of zinc and copper dipping in the solutions of their respective salts.", "fibs": ["cell"]}
{"text": "Fig.", "fibs": ["Fig"]}
{"text": "3.2 Functioning of Daniell cell when external voltage Eext opposing the cell potential is applied.", "fibs": ["cell"]}
{"text": "If an external opposite potential is applied in the galvanic cell [Fig.", "fibs": ["cell"]}
{"text": "3.2(a)] and increased slowly, we find that the reaction continues to take place till the opposing voltage reaches the value 1.1 V [Fig.", "fibs": ["3.2(a"]}
{"text": "3.2(b)] when, the reaction stops altogether and no current flows through the cell.", "fibs": ["3.2(b"]}
{"text": "Any further increase in the external potential again starts the reaction but in the opposite direction [Fig.", "fibs": ["increase"]}
{"text": "3.2(c)].", "fibs": ["3.2(c"]}
{"text": "It now functions as an electrolytic cell, a device for using electrical energy to carry non-spontaneous chemical reactions.", "fibs": ["cell"]}
{"text": "Both types of cells are quite important and we shall study some of their salient features in the following pages.", "fibs": ["study"]}
{"text": "*Strictly speaking activity should be used instead of concentration.", "fibs": ["activity"]}
{"text": "It is directly proportional to concentration.", "fibs": ["concentration"]}
{"text": "In dilute solutions, it is equal to concentration.", "fibs": ["concentration"]}
{"text": "You will study more about it in higher classes.", "fibs": ["study"]}
{"text": "3.2 Galvanic Cells 
As mentioned earlier (Class XI, Unit 8) a galvanic cell is an electrochemical cell that converts the chemical energy of a spontaneous redox reaction into electrical energy.", "fibs": ["XI"]}
{"text": "In this device the Gibbs energy of the spontaneous redox reaction is converted into electrical work which may be used for running a motor or other electrical gadgets like heater, fan, geyser, etc.", "fibs": ["device"]}
{"text": "Daniell cell discussed earlier is one such cell in which the following redox reaction occurs.", "fibs": ["cell"]}
{"text": "Zn(s) + Cu2+(aq) → Zn2+ (aq) + Cu(s)
This reaction is a combination of two half reactions whose addition gives the overall cell reaction:
(i) Cu2+ + 2e– → Cu(s) (reduction half reaction)                                      (3.2)
(ii) Zn(s) → Zn2+ + 2e– (oxidation half reaction)                                      (3.3)
These reactions occur in two different portions of the Daniell cell.", "fibs": ["Cu2+(aq"]}
{"text": "The reduction half reaction occurs on the copper electrode while the oxidation half reaction occurs on the zinc electrode.", "fibs": ["reduction"]}
{"text": "These two portions of the cell are also called half-cells or redox couples.", "fibs": ["cell"]}
{"text": "The copper electrode may be called the reduction half cell and the zinc electrode, the oxidation half-cell.", "fibs": ["copper"]}
{"text": "We can construct innumerable number of galvanic cells on the pattern of Daniell cell by taking combinations of different half-cells.", "fibs": ["number"]}
{"text": "Each half-cell consists of a metallic electrode dipped into an electrolyte.", "fibs": ["electrode"]}
{"text": "The two half-cells are connected by a metallic wire through a voltmeter and a switch externally.", "fibs": ["wire"]}
{"text": "The electrolytes of the two half-cells are connected internally through a salt bridge as shown in Fig.", "fibs": ["salt"]}
{"text": "Sometimes, both the electrodes dip in the same electrolyte solution and in such cases we do not require a salt bridge.", "fibs": ["dip"]}
{"text": "At each electrode-electrolyte interface there is a tendency of metal ions from the solution to deposit on the metal electrode trying to make it positively charged.", "fibs": ["interface"]}
{"text": "At the same time, metal atoms of the electrode have a tendency to go into the solution as ions and leave behind the electrons at the electrode trying to make it negatively charged.", "fibs": ["time"]}
{"text": "At equilibrium, there is a separation of charges and depending on the tendencies of the two opposing reactions, the electrode may be positively or negatively charged with respect to the solution.", "fibs": ["equilibrium"]}
{"text": "A potential difference develops between the electrode and the electrolyte which is called electrode potential.", "fibs": ["difference"]}
{"text": "When the concentrations of all the species involved in a half-cell is unity then the electrode potential is known as standard electrode potential.", "fibs": ["species"]}
{"text": "According to IUPAC convention, standard reduction potentials are now called standard electrode potentials.", "fibs": ["IUPAC"]}
{"text": "In a galvanic cell, the half-cell in which oxidation takes place is called anode and it has a negative potential with respect to the solution.", "fibs": ["cell"]}
{"text": "The other half-cell in which reduction takes place is called cathode and it has a positive potential with respect to the solution.", "fibs": ["reduction"]}
{"text": "Thus, there exists a potential difference between the two electrodes and as soon as the switch is in the on position the electrons flow from negative electrode to positive electrode.", "fibs": ["difference"]}
{"text": "The direction of current flow is opposite to that of electron flow.", "fibs": ["direction"]}
{"text": "The potential difference between the two electrodes of a galvanic cell is called the cell potential and is measured in volts.", "fibs": ["difference"]}
{"text": "The cell potential is the difference between the electrode potentials (reduction potentials) of the cathode and anode.", "fibs": ["cell"]}
{"text": "It is called the cell electromotive force (emf) of the cell when no current is drawn through the cell.", "fibs": ["cell"]}
{"text": "It is now an accepted convention that we keep the anode on the left and the cathode on the right while representing the galvanic cell.", "fibs": ["convention"]}
{"text": "A galvanic cell is generally represented by putting a vertical line between metal and electrolyte solution and putting a double vertical line between the two electrolytes connected by a salt bridge.", "fibs": ["cell"]}
{"text": "Under this convention the emf of the cell is positive and is given by the potential of the half-cell on the right hand side minus the potential of the half-cell on the left hand side i.e.,
Ecell = Eright – Eleft
This is illustrated by the following example:
Cell reaction:
Cu(s) + 2Ag+(aq) → Cu2+(aq) + 2 Ag(s)                                     (3.4)
Half-cell reactions:
Cathode (reduction): 2Ag+(aq) + 2e– → 2Ag(s)                             (3.5)
Anode (oxidation): Cu(s) → Cu2+(aq) + 2e–                                  (3.6)
It can be seen that the sum of (3.5) and (3.6) leads to overall reaction (3.4) in the cell and that silver electrode acts as a cathode and copper electrode acts as an anode.", "fibs": ["convention"]}
{"text": "The cell can be represented as:
Cu(s)|Cu2+(aq) || Ag+(aq)|Ag(s)
and we have Ecell = Eright – Eleft = EAg+Ag – ECu2+Cu                                        (3.7)
3.2.1 Measurement of Electrode Potential
The potential of individual half-cell cannot be measured.", "fibs": ["cell"]}
{"text": "We can measure only the difference between the two half-cell potentials that gives the emf of the cell.", "fibs": ["measure"]}
{"text": "If we arbitrarily choose the potential of one electrode (half-cell) then that of the other can be determined with respect to this.", "fibs": ["electrode"]}
{"text": "According to convention, a half-cell called standard hydrogen electrode (Fig.3.3) represented by Pt(s) H2(g) H+(aq), is assigned a zero potential at all temperatures corresponding to the reaction
H+ (aq) + e– → H2(g)





Fig.", "fibs": ["convention"]}
{"text": "3.3: Standard Hydrogen Electrode (SHE).", "fibs": ["Hydrogen"]}
{"text": "The standard hydrogen electrode consists of a platinum electrode coated with platinum black.", "fibs": ["hydrogen"]}
{"text": "The electrode is dipped in an acidic solution and pure hydrogen gas is bubbled through it.", "fibs": ["electrode"]}
{"text": "The concentration of both the reduced and oxidised forms of hydrogen is maintained at unity (Fig.", "fibs": ["concentration"]}
{"text": "This implies that the pressure of hydrogen gas is one bar and the concentration of hydrogen ion in the solution is one molar.", "fibs": ["pressure"]}
{"text": "At 298 K the emf of the cell, standard hydrogen electrode second half-cell constructed by taking standard hydrogen electrode as anode (reference half-cell) and the other half-cell as cathode, gives the reduction potential of the other half-cell.", "fibs": ["emf"]}
{"text": "If the concentrations of the oxidised and the reduced forms of the species in the right hand half-cell are unity, then the cell potential is equal to standard electrode potential, EƟR of the given half-cell.", "fibs": ["species"]}
{"text": "EƟ = EƟR – EƟL
As EƟL for standard hydrogen electrode is zero.", "fibs": ["EƟ"]}
{"text": "EƟ = EƟR – 0 = EƟR
The measured emf of the cell:
Pt(s)  ∣ H2(g, 1 bar)  ∣ H+ (aq, 1 M)  ∣ ∣ Cu2+ (aq, 1 M)   ∣ Cu
is 0.34 V and it is also the value for the standard electrode potential of the half-cell corresponding to the reaction:
Cu2+ (aq, 1M) + 2 e– → Cu(s)
Similarly, the measured emf of the cell:
Pt(s)  ∣ H2(g, 1 bar)  ∣  H+ (aq, 1 M)   ∣ ∣  Zn2+ (aq, 1M)  ∣  Zn
is -0.76 V corresponding to the standard electrode potential of the half-cell reaction:
Zn2+ (aq, 1 M) + 2e– → Zn(s)
The positive value of the standard electrode potential in the first case indicates that Cu2+ ions get reduced more easily than H+ ions.", "fibs": ["EƟ"]}
{"text": "The reverse process cannot occur, that is, hydrogen ions cannot oxidise Cu (or alternatively we can say that hydrogen gas can reduce copper ion) under the standard conditions described above.", "fibs": ["process"]}
{"text": "Thus, Cu does not dissolve in HCl.", "fibs": ["HCl"]}
{"text": "In nitric acid it is oxidised by nitrate ion and not by hydrogen ion.", "fibs": ["nitric"]}
{"text": "The negative value of the standard electrode potential in the second case indicates that hydrogen ions can oxidise zinc (or zinc can reduce hydrogen ions).", "fibs": ["value"]}
{"text": "In view of this convention, the half reaction for the Daniell cell in Fig.", "fibs": ["view"]}
{"text": "3.1 can be written as:
Left electrode: Zn(s) → Zn2+ (aq, 1 M) + 2 e–
Right electrode: Cu2+ (aq, 1 M) + 2 e– → Cu(s)
The overall reaction of the cell is the sum of above two reactions and we obtain the equation:
Zn(s) + Cu2+ (aq) → Zn2+ (aq) + Cu(s)
emf of the cell =  = E0R – E0L
= 0.34V – (– 0.76)V = 1.10 V
Sometimes metals like platinum or gold are used as inert electrodes.", "fibs": ["electrode"]}
{"text": "They do not participate in the reaction but provide their surface for oxidation or reduction reactions and for the conduction of electrons.", "fibs": ["reaction"]}
{"text": "For example, Pt is used in the following half-cells:
Hydrogen electrode: Pt(s) | H2(g) | H+(aq)
With half-cell reaction: H+ (aq)+ e– → ½ H2(g)
Bromine electrode: Pt(s) | Br2(aq) | Br–(aq)
With half-cell reaction: ½ Br2(aq) + e– → Br–(aq)
The standard electrode potentials are very important and we can extract a lot of useful information from them.", "fibs": ["example"]}
{"text": "The values of standard electrode potentials for some selected half-cell reduction reactions are given in Table 3.1.", "fibs": ["electrode"]}
{"text": "If the standard electrode potential of an electrode is greater than zero then its reduced form is more stable compared to hydrogen gas.", "fibs": ["electrode"]}
{"text": "Similarly, if the standard electrode potential is negative then hydrogen gas is more stable than the reduced form of the species.", "fibs": ["electrode"]}
{"text": "It can be seen that the standard electrode potential for fluorine is the highest in the Table indicating that fluorine gas (F2) has the maximum tendency to get reduced to fluoride ions (F–) and therefore fluorine gas is the strongest oxidising agent and fluoride ion is the weakest reducing agent.", "fibs": ["electrode"]}
{"text": "Lithium has the lowest electrode potential indicating that lithium ion is the weakest oxidising agent while lithium metal is the most powerful reducing agent in an aqueous solution.", "fibs": ["Lithium"]}
{"text": "It may be seen that as we go from top to bottom in Table 3.1 the standard electrode potential decreases and with this, decreases the oxidising power of the species on the left and increases the reducing power of the species on the right hand side of the reaction.", "fibs": ["bottom"]}
{"text": "Electrochemical cells are extensively used for determining the pH of solutions, solubility product, equilibrium constant and other thermodynamic properties and for potentiometric titrations.", "fibs": ["solubility"]}
{"text": "Intext Questions
3.1 How would you determine the standard electrode potential of the system Mg2+|Mg?", "fibs": ["electrode"]}
{"text": "3.2 Can you store copper sulphate solutions in a zinc pot?", "fibs": ["store"]}
{"text": "3.3 Consult the table of standard electrode potentials and suggest three substances that can oxidise ferrous ions under suitable conditions.", "fibs": ["table"]}
{"text": "3.3 Nernst Equation
We have assumed in the previous section that the concentration of all the species involved in the electrode reaction is unity.", "fibs": ["section"]}
{"text": "This need not be always true.", "fibs": ["need"]}
{"text": "Nernst showed that for the electrode reaction:
Mn+(aq) + ne–→ M(s)
the electrode potential at any concentration measured with respect to standard hydrogen electrode can be represented by:




          but concentration of solid M is taken as unity and we have



                          (3.8)
has already been defined, R is gas constant (8.314 JK–1 mol–1), F is Faraday constant (96487 C mol–1), T is temperature in kelvin and [Mn+] is the concentration of the species, Mn+.", "fibs": ["electrode"]}
{"text": "Table 3.1: Standard Electrode Potentials at 298 K

Ions are present as aqueous species and H2O as liquid; gases and solids are shown by g and s.

1.", "fibs": ["Table"]}
{"text": "A negative EƟ means that the redox couple is a stronger reducing agent than the H+/H2 couple.", "fibs": ["EƟ"]}
{"text": "A positive EƟ means that the redox couple is a weaker reducing agent than the H+/H2 couple.", "fibs": ["EƟ"]}
{"text": "In Daniell cell, the electrode potential for any given concentration of Cu2+ and Zn2+ ions, we write
For Cathode:
              (3.9)
For Anode:



                 (3.10)



The cell potential, E(cell) =  – 
= 
=                                                                             (3.11)
It can be seen that E(cell) depends on the concentration of both Cu2+ and Zn2+ ions.", "fibs": ["cell"]}
{"text": "It increases with increase in the concentration of Cu2+ ions and decrease in the concentration of Zn2+ ions.", "fibs": ["increase"]}
{"text": "By converting the natural logarithm in Eq.", "fibs": ["logarithm"]}
{"text": "(3.11) to the base 10 and substituting the values of R, F and T = 298 K, it reduces to
                                                             (3.12)
We should use the same number of electrons (n) for both the electrodes and thus for the following cell
Ni(s) ∣   Ni2+(aq) ∣ ∣  Ag+(aq) ∣ Ag
The cell reaction is Ni(s) + 2Ag+(aq) → Ni2+(aq) + 2Ag(s)
The Nernst equation can be written as

and for a general electrochemical reaction of the type:
a A + bB  cC + dD
Nernst equation can be written as:

                                                                   (3.13)



Example 3.1
Represent the cell in which the following reaction takes place
Mg(s) + 2Ag+(0.0001M) → Mg2+(0.130M) + 2Ag(s)
Calculate its E(cell) if  EƟ(cell)= 3.17 V.
Solution
The cell can be written as Mg ∣ Mg2+(0.130M) ∣∣Ag+  ∣(0.0001M)Ag

= 3.17 V –  = 3.17 V – 0.21V = 2.96 V.


3.3.1 Equilibrium Constant from Nernst Equation

If the circuit in Daniell cell (Fig.", "fibs": ["base"]}
{"text": "3.1) is closed then we note that the reaction
Zn(s) + Cu2+(aq) → Zn2+(aq) + Cu(s)                               (3.1)
takes place and as time passes, the concentration of Zn2+ keeps on increasing while the concentration of Cu2+ keeps on decreasing.", "fibs": ["note"]}
{"text": "At the same time voltage of the cell as read on the voltmeter keeps on decreasing.", "fibs": ["time"]}
{"text": "After some time, we shall note that there is no change in the concentration of Cu2+ and Zn2+ ions and at the same time, voltmeter gives zero reading.", "fibs": ["time"]}
{"text": "This indicates that equilibrium has been attained.", "fibs": ["equilibrium"]}
{"text": "In this situation the Nernst equation may be written as:






or  
But at equilibrium,
 = Kc for the reaction 3.1
and at T = 298K the above equation can be written as

log KC = 
KC = 2 × 1037 at 298K.", "fibs": ["situation"]}
{"text": "In general,
                                                                          (3.14)
Thus, Eq.", "fibs": ["Eq."]}
{"text": "(3.14) gives a relationship between equilibrium constant of the reaction and standard potential of the cell in which that reaction takes place.", "fibs": ["relationship"]}
{"text": "Thus, equilibrium constants of the reaction, difficult to measure otherwise, can be calculated from the corresponding EƟ value of the cell.", "fibs": ["equilibrium"]}
{"text": "Example 3.2
Calculate the equilibrium constant of the reaction:
Cu(s) + 2Ag+(aq) → Cu2+(aq) + 2Ag(s)
Solution
EƟ(cell) = 0.46 V
EƟ(cell)=  log KC = 0.46 V or


KC = 3.92 × 1015

3.3.2 Electro-chemical Cell and Gibbs Energy of the Reaction
Electrical work done in one second is equal to electrical potential multiplied by total charge passed.", "fibs": ["Example"]}
{"text": "If we want to obtain maximum work from a galvanic cell then charge has to be passed reversibly.", "fibs": ["work"]}
{"text": "The reversible work done by a galvanic cell is equal to decrease in its Gibbs energy and therefore, if the emf of the cell is E and nF is the amount of charge passed and ∆rG is the Gibbs energy of the reaction, then
∆rG = – nFE(cell)                                                                                                   (3.15)
It may be remembered that E(cell) is an intensive parameter but ∆rG is an extensive thermodynamic property and the value depends on n. Thus, if we write the reaction
Zn(s) + Cu2+(aq) → Zn2+(aq) + Cu(s)                                            (3.1)
∆rG = – 2FE(cell)
but when we write the reaction
2 Zn (s) + 2 Cu2+(aq) →2 Zn2+(aq) + 2Cu(s)
∆rG = – 4FE(cell)


If the concentration of all the reacting species is unity, then


E(cell) = EƟ(cell) and we have

∆rGƟ = – nFEƟ(cell)                                                                            (3.16)
Thus, from the measurement of EƟ(cell) we can obtain an important thermodynamic quantity, ∆rGJ, standard Gibbs energy of the reaction.", "fibs": ["work"]}
{"text": "From the latter we can calculate equilibrium constant by the equation:
∆rGƟ = –RT ln K.

Example 3.3
The standard electrode potential for Daniell cell is 1.1V.", "fibs": ["latter"]}
{"text": "Calculate the standard Gibbs energy for the reaction:
Zn(s) + Cu2+(aq) → Zn2+(aq) + Cu(s)
Solution
∆rGƟ = – nFEƟ(cell)
n in the above equation is 2, F = 96487 C mol–1 and EƟ(cell)= 1.1 V
Therefore, ∆rGƟ = – 2 × 1.1V × 96487 C mol–1
= – 21227 J mol–1
= – 212.27 kJ mol–1



        Intext Questions
      
3.4 Calculate the potential of hydrogen electrode in contact with a solution whose pH is 10.", "fibs": ["energy"]}
{"text": "3.5 Calculate the emf of the cell in which the following reaction takes place:
Ni(s) + 2Ag+ (0.002 M) → Ni2+ (0.160 M) + 2Ag(s)
Given that EƟ(cell)= 1.05 V
3.6 The cell in which the following reaction occurs:

 has  = 0.236 V at 298 K. Calculate the standard Gibbs energy and the equilibrium constant of the cell reaction.", "fibs": ["emf"]}
{"text": "3.4 Conductance of Electrolytic Solutions
It is necessary to define a few terms before we consider the subject of conductance of electricity through electrolytic solutions.", "fibs": ["subject"]}
{"text": "The electrical resistance is represented by the symbol ‘R’ and it is measured in ohm (Ω) which in terms of SI base units is equal to (kg m2)/(S3 A2).", "fibs": ["resistance"]}
{"text": "It can be measured with the help of a Wheatstone bridge with which you are familiar from your study of physics.", "fibs": ["bridge"]}
{"text": "The electrical resistance of any object is directly proportional to its length, l, and inversely proportional to its area of cross section, A.", "fibs": ["resistance"]}
{"text": "That is,
R ∝  or R = ρ                                                    (3.17)



The constant of proportionality, ρ (Greek, rho), is called resistivity (specific resistance).", "fibs": ["R"]}
{"text": "Its SI units are ohm metre (Ω m) and quite often its submultiple, ohm centimetre (Ω cm) is also used.", "fibs": ["SI"]}
{"text": "IUPAC recommends the use of the term resistivity over specific resistance and hence in the rest of the book we shall use the term resistivity.", "fibs": ["IUPAC"]}
{"text": "Physically, the resistivity for a substance is its resistance when it is one metre long and its area of cross section is one m2.", "fibs": ["resistivity"]}
{"text": "It can be seen that:



1 Ω m = 100 Ω cm or 1 Ω cm = 0.01 Ω m
The inverse of resistance, R, is called conductance, G, and we have the relation:
G = =                                                (3.18)


The SI unit of conductance is siemens, represented by the symbol ‘S’ and is equal to ohm–1 (also known as mho) or Ω–1.", "fibs": ["cm"]}
{"text": "The inverse of resistivity, called conductivity (specific conductance) is represented by the symbol, κ (Greek, kappa).", "fibs": ["resistivity"]}
{"text": "IUPAC has recommended the use of term conductivity over specific conductance and hence we shall use the term conductivity in the rest of the book.", "fibs": ["IUPAC"]}
{"text": "The SI units of conductivity are S m–1 but quite often, κ is expressed in S cm–1.", "fibs": ["SI"]}
{"text": "Conductivity of a material in S m–1 is its conductance when it is 1 m long and its area of cross section is 1 m2.", "fibs": ["Conductivity"]}
{"text": "It may be noted that 1 S cm–1 = 100 S m–1.", "fibs": ["cm–1"]}
{"text": "Table 3.2: The values of Conductivity of some Selected Materials at 298.15 K





It can be seen from Table 3.2 that the magnitude of conductivity varies a great deal and depends on the nature of the material.", "fibs": ["Table"]}
{"text": "It also depends on the temperature and pressure at which the measurements are made.", "fibs": ["temperature"]}
{"text": "Materials are classified into conductors, insulators and semiconductors depending on the magnitude of their conductivity.", "fibs": ["magnitude"]}
{"text": "Metals and their alloys have very large conductivity and are known as conductors.", "fibs": ["conductivity"]}
{"text": "Certain non-metals like carbon-black, graphite and some organic polymers* are also electronically conducting.", "fibs": ["graphite"]}
{"text": "Substances like glass, ceramics, etc., having very low conductivity are known as insulators.", "fibs": ["glass"]}
{"text": "Substances like silicon, doped silicon and gallium arsenide having conductivity between conductors and insulators are called semiconductors and are important electronic materials.", "fibs": ["silicon"]}
{"text": "Certain materials called superconductors by definition have zero resistivity or infinite conductivity.", "fibs": ["definition"]}
{"text": "Earlier, only metals and their alloys at very low temperatures (0 to 15 K) were known to behave as superconductors, but nowadays a number of ceramic materials and mixed oxides are also known to show superconductivity at temperatures as high as 150 K.
Electrical conductance through metals is called metallic or electronic conductance and is due to the movement of electrons.", "fibs": ["number"]}
{"text": "The electronic conductance depends on
(i) the nature and structure of the metal
(ii) the number of valence electrons per atom
(iii) temperature (it decreases with increase of temperature).", "fibs": ["conductance"]}
{"text": "* Electronically conducting polymers – In 1977 MacDiarmid, Heeger and Shirakawa discovered that acetylene gas can be polymerised to produce a polymer, polyacetylene when exposed to vapours of iodine acquires metallic lustre and conductivity.", "fibs": ["MacDiarmid"]}
{"text": "Since then several organic conducting polymers have been made such as polyaniline, polypyrrole and polythiophene.", "fibs": ["polyaniline"]}
{"text": "These organic polymers which have properties like metals, being composed wholly of elements like carbon, hydrogen and occasionally nitrogen, oxygen or sulphur, are much lighter than normal metals and can be used for making light-weight batteries.", "fibs": ["carbon"]}
{"text": "Besides, they have the mechanical properties of polymers such as flexibility so that one can make electronic devices such as transistors that can bend like a sheet of plastic.", "fibs": ["flexibility"]}
{"text": "For the discovery of conducting polymers, MacDiarmid, Heeger and Shirakawa were awarded the Nobel Prize in Chemistry for the year 2000.", "fibs": ["discovery"]}
{"text": "As the electrons enter at one end and go out through the other end, the composition of the metallic conductor remains unchanged.", "fibs": ["end"]}
{"text": "The mechanism of conductance through semiconductors is more complex.", "fibs": ["mechanism"]}
{"text": "We already know (Class XI, Unit 7) that even very pure water has small amounts of hydrogen and hydroxyl ions (~10–7M) which lend it very low conductivity (3.5 × 10–5 S m–1).", "fibs": ["XI"]}
{"text": "When electrolytes are dissolved in water, they furnish their own ions in the solution hence its conductivity also increases.", "fibs": ["water"]}
{"text": "The conductance of electricity by ions present in the solutions is called electrolytic or ionic conductance.", "fibs": ["conductance"]}
{"text": "The conductivity of electrolytic (ionic) solutions depends on:
(i) the nature of the electrolyte added
(ii) size of the ions produced and their solvation
(iii) the nature of the solvent and its viscosity
(iv) concentration of the electrolyte
(v) temperature (it increases with the increase of temperature).", "fibs": ["conductivity"]}
{"text": "Passage of direct current through ionic solution over a prolonged period can lead to change in its composition due to electrochemical reactions (Section 3.4.1).", "fibs": ["Passage"]}
{"text": "3.4.1 Measurement of the Conductivity of Ionic Solutions
We know that accurate measurement of an unknown resistance can be performed on a Wheatstone bridge.", "fibs": ["measurement"]}
{"text": "However, for measuring the resistance of an ionic solution we face two problems.", "fibs": ["resistance"]}
{"text": "Firstly, passing direct current (DC) changes the composition of the solution.", "fibs": ["DC"]}
{"text": "Secondly, a solution cannot be connected to the bridge like a metallic wire or other solid conductor.", "fibs": ["solution"]}
{"text": "The first difficulty is resolved by using an alternating current (AC) source of power.", "fibs": ["difficulty"]}
{"text": "The second problem is solved by using a specially designed vessel called conductivity cell.", "fibs": ["problem"]}
{"text": "It is available in several designs and two simple ones are shown in Fig.", "fibs": ["Fig"]}
{"text": "Fig.", "fibs": ["Fig"]}
{"text": "3.4 Two different types of conductivity cells.", "fibs": ["conductivity"]}
{"text": "Basically it consists of two platinum electrodes coated with platinum black (finely divided metallic Pt is deposited on the electrodes electrochemically).", "fibs": ["platinum"]}
{"text": "These have area of cross section equal to ‘A’ and are separated by distance ‘l’.", "fibs": ["area"]}
{"text": "Therefore, solution confined between these electrodes is a column of length l and area of cross section A.", "fibs": ["solution"]}
{"text": "The resistance of such a column of solution is then given by the equation:
R = ρ =                                                                                 (3.17)
The quantity l / A is called cell constant denoted by the symbol, G*.", "fibs": ["resistance"]}
{"text": "It depends on the distance between the electrodes and their area of cross-section and has the dimension of length–1 and can be calculated if we know l and A.", "fibs": ["distance"]}
{"text": "Measurement of l and A is not only inconvenient but also unreliable.", "fibs": ["l"]}
{"text": "The cell constant is usually determined by measuring the resistance of the cell containing a solution whose conductivity is already known.", "fibs": ["cell"]}
{"text": "For this purpose, we generally use KCl solutions whose conductivity is known accurately at various concentrations (Table 3.3) and at different temperatures.", "fibs": ["purpose"]}
{"text": "The cell constant, G*, is then given by the equation:
G* =  = R κ                                                                                 (3.18)
Table 3.3: Conductivity and Molar conductivity of KCl solutions at 298.15K

Once the cell constant is determined, we can use it for measuring the resistance or conductivity of any solution.", "fibs": ["cell"]}
{"text": "The set up for the measurement of the resistance is shown in Fig.", "fibs": ["measurement"]}
{"text": "Fig.", "fibs": ["Fig"]}
{"text": "3.5: Arrangement for measurement of resistance of a solution of an electrolyte.", "fibs": ["measurement"]}
{"text": "It consists of two resistances R3 and R4, a variable resistance R1 and the conductivity cell having the unknown resistance R2.", "fibs": ["resistance"]}
{"text": "The Wheatstone bridge is fed by an oscillator O (a source of a.c. power in the audio frequency range 550 to 5000 cycles per second).", "fibs": ["bridge"]}
{"text": "P is a suitable detector (a headphone or other electronic device) and the bridge is balanced when no current passes through the detector.", "fibs": ["P"]}
{"text": "Under these conditions:








Unknown resistance R2 =                                                                      (3.19)
These days, inexpensive conductivity meters are available which can directly read the conductance or resistance of the solution in the conductivity cell.", "fibs": ["resistance"]}
{"text": "Once the cell constant and the resistance of the solution in the cell is determined, the conductivity of the solution is given by the equation:
                                                                           (3.20)
The conductivity of solutions of different electrolytes in the same solvent and at a given temperature differs due to charge and size of the ions in which they dissociate, the concentration of ions or ease with which the ions move under a potential gradient.", "fibs": ["cell"]}
{"text": "It, therefore, becomes necessary to define a physically more meaningful quantity called molar conductivity denoted by the symbol Λm (Greek, lambda).", "fibs": ["quantity"]}
{"text": "It is related to the conductivity of the solution by the equation:
Molar conductivity = Λm =                                                                  (3.21)
In the above equation, if κ is expressed in S m–1 and the concentration, c in mol m–3 then the units of Λm are in S m2 mol–1.", "fibs": ["conductivity"]}
{"text": "It may be noted that:
1 mol m–3 = 1000(L/m3) × molarity (mol/L), and hence
Λm(S cm2 mol–1) = 
If we use S cm–1 as the units for κ and mol cm–3, the units of concentration, then the units for Λm are S cm2 mol–1.", "fibs": ["mol"]}
{"text": "It can be calculated by using the equation:
Λm (S cm2 mol–1) = 
Both type of units are used in literature and are related to each other by the equations:
1 S m2mol–1 = 104 S cm2mol–1 or
1 S cm2mol–1 = 10–4 S m2mol–1.", "fibs": ["equation"]}
{"text": "Example 3.4
Resistance of a conductivity cell filled with 0.1 mol L–1 KCl solution is 100 Ω .", "fibs": ["Example"]}
{"text": "If the resistance of the same cell when filled with 0.02 mol L–1 KCl solution is 520 Ω , calculate the conductivity and molar conductivity of 0.02 mol L–1 KCl solution.", "fibs": ["resistance"]}
{"text": "The conductivity of 0.1 mol L–1 KCl solution is 1.29 S/m.", "fibs": ["conductivity"]}
{"text": "The cell constant is given by the equation:
Cell constant = G* = conductivity × resistance
= 1.29 S/m × 100 Ω = 129 m–1 = 1.29 cm–1
Conductivity of 0.02 mol L–1 KCl solution = cell constant / resistance
= = = 0.248 S m–1
Concentration = 0.02 mol L–1
= 1000 × 0.02 mol m–3 = 20 mol m–3
Molar conductivity = 
=  = 124 × 10–4 S m2mol–1
Alternatively, κ =  = 0.248 × 10–2 S cm–1
and Λm = κ × 1000 cm3 L–1 molarity–1

= 124 S cm2 mol–1
Example 3.5
The electrical resistance of a column of 0.05 mol L–1 NaOH solution of diameter 1 cm and length 50 cm is 5.55 × 103 ohm.", "fibs": ["cell"]}
{"text": "Calculate its resistivity, conductivity and molar conductivity.", "fibs": ["resistivity"]}
{"text": "Solution
A = π r2 = 3.14 × 0.52 cm2 = 0.785 cm2 = 0.785 × 10–4 m2
l = 50 cm = 0.5 m
 or  =87.135 Ω cm
Conductivity = =  S cm–1
= 0.01148 S cm–1
Molar conductivity,  =  cm3 L–1
= 
= 229.6 S cm2 mol–1
If we want to calculate the values of different quantities in terms of ‘m’ instead of ‘cm’,

=  = 87.135 ×10–2 Ω m
 =  = 1.148S m–1

and  =  = 229.6 × 10–4 S m2 mol–1.", "fibs": ["π"]}
{"text": "3.4.2 Variation of Conductivity and Molar Conductivity with Concentration
Both conductivity and molar conductivity change with the concentration of the electrolyte.", "fibs": ["conductivity"]}
{"text": "Conductivity always decreases with decrease in concentration both, for weak and strong electrolytes.", "fibs": ["Conductivity"]}
{"text": "This can be explained by the fact that the number of ions per unit volume that carry the current in a solution decreases on dilution.", "fibs": ["fact"]}
{"text": "The conductivity of a solution at any given concentration is the conductance of one unit volume of solution kept between two platinum electrodes with unit area of cross section and at a distance of unit length.", "fibs": ["conductivity"]}
{"text": "This is clear from the equation:


 (both A and l are unity in their appropriate units in m or cm)
Molar conductivity of a solution at a given concentration is the conductance of the volume V of solution containing one mole of electrolyte kept between two electrodes with area of cross section A and distance of unit length.", "fibs": ["equation"]}
{"text": "Therefore,

Since l = 1 and A = V ( volume containing 1 mole of electrolyte)
Λm = κ V                                                                                                     (3.22)
Molar conductivity increases with decrease in concentration.", "fibs": ["l"]}
{"text": "This is because the total volume, V, of solution containing one mole of electrolyte also increases.", "fibs": ["volume"]}
{"text": "It has been found that decrease in κ on dilution of a solution is more than compensated by increase in its volume.", "fibs": ["decrease"]}
{"text": "Physically, it means that at a given concentration, Λm can be defined as the conductance of the electrolytic solution kept between the electrodes of a conductivity cell at unit distance but having area of cross section large enough to accommodate sufficient volume of solution that contains one mole of the electrolyte.", "fibs": ["concentration"]}
{"text": "When concentration approaches zero, the molar conductivity is known as limiting molar conductivity and is represented by the symbol Λ°m .", "fibs": ["concentration"]}
{"text": "The variation in Λm with concentration is different (Fig.", "fibs": ["variation"]}
{"text": "Fig.", "fibs": ["Fig"]}
{"text": "3.6: Molar conductivity versus c½ for acetic acid (weak electrolyte) and potassium chloride (strong electrolyte) in aqueous solutions.", "fibs": ["conductivity"]}
{"text": "Strong Electrolytes
For strong electrolytes, Λm increases slowly with dilution and can be represented by the equation:
Λm = Λ°m – A c ½                                                                                                           (3.23)


It can be seen that if we plot (Fig.", "fibs": ["dilution"]}
{"text": "3.12) Λm against c1/2, we obtain a straight line with intercept equal to Λ°m and slope equal to ‘–A’.", "fibs": ["c1/2"]}
{"text": "The value of the constant ‘A’ for a given solvent and temperature depends on the type of electrolyte i.e., the charges on the cation and anion produced on the dissociation of the electrolyte in the solution.", "fibs": ["value"]}
{"text": "Thus, NaCl, CaCl2, MgSO4 are known as 1-1, 2-1 and 2-2 electrolytes respectively.", "fibs": ["NaCl"]}
{"text": "All electrolytes of a particular type have the same value for ‘A’.", "fibs": ["type"]}
{"text": "Example 3.6

The molar conductivity of KCl solutions at different concentrations at 298 K are given below:

Show that a plot between Λm and c1/2 is a straight line.", "fibs": ["Example"]}
{"text": "Determine the values of Λ°mand A for KCl.", "fibs": ["Λ°mand"]}
{"text": "Solution


Taking the square root of concentration we obtain:

A plot of Λm ( y-axis) and c1/2 (x-axis) is shown in (Fig.", "fibs": ["square"]}
{"text": "It can be seen that it is nearly a straight line.", "fibs": ["line"]}
{"text": "From the intercept (c1/2 = 0), we find that

Λ°m = 150.0 S cm2 mol–1 and
A = – slope = 87.46 S cm2 mol–1/(mol/L–1)1/2.", "fibs": ["intercept"]}
{"text": "Fig.", "fibs": ["Fig"]}
{"text": "3.7: Variation of Λm against c½.", "fibs": ["c½"]}
{"text": "Kohlrausch examined Λ°m values for a number of strong electrolytes and observed certain regularities.", "fibs": ["Λ°m"]}
{"text": "He noted that the difference in Λ°m of the electrolytes NaX and KX for any X is nearly constant.", "fibs": ["difference"]}
{"text": "For example at 298 K:

Λ°m (KCl) – Λ°m (NaCl) = Λ°m (KBr) – Λ°m (NaBr)
= Λ°m (KI) – Λ°m (NaI) ≃ 23.4 S cm2 mol–1
and similarly it was found that
Λ°m (NaBr)– Λ°m (NaCl) = Λ°m (KBr) – Λ°m (KCl)   ≃ 1.8 S cm2 mol–1


On the basis of the above observations he enunciated Kohlrausch law of independent migration of ions.", "fibs": ["example"]}
{"text": "The law states that limiting molar conductivity of an electrolyte can be represented as the sum of the individual contributions of the anion and cation of the electrolyte.", "fibs": ["law"]}
{"text": "Thus, if λ°Na+ and λ°Cl– are limiting molar conductivity of the sodium and chloride ions respectively, then the limiting molar conductivity for sodium chloride is given by the equation:
Λ°m (NaCl) = λ°Na+ + λ°Cl–                                                                                      (3.24)
In general, if an electrolyte on dissociation gives ν+ cations and ν– anions then its limiting molar conductivity is given by:
Λ°m = ν+ λ°+ + ν– λ°–                                                                                               (3.25)
Here, λ°+ and λ°– are the limiting molar conductivities of the cation and anion respectively.", "fibs": ["λ°Na"]}
{"text": "The values of λ° for some cations and anions at 298 K are given in Table 3.4.", "fibs": ["λ°"]}
{"text": "Table 3.4: Limiting Molar Conductivity for some Ions in Water at 298 K




Weak Electrolytes
Weak electrolytes like acetic acid have lower degree of dissociation at higher concentrations and hence for such electrolytes, the change in Λm with dilution is due to increase in the degree of dissociation and consequently the number of ions in total volume of solution that contains 1 mol of electrolyte.", "fibs": ["Table"]}
{"text": "In such cases Λmincreases steeply (Fig.", "fibs": ["Fig"]}
{"text": "3.12) on dilution, especially near lower concentrations.", "fibs": ["dilution"]}
{"text": "Therefore, Λ°m cannot be obtained by extrapolation of Λm to zero concentration.", "fibs": ["Λ°m"]}
{"text": "At infinite dilution (i.e., concentration c → zero) electrolyte dissociates completely (α=1), but at such low concentration the conductivity of the solution is so low that it cannot be measured accurately.", "fibs": ["dilution"]}
{"text": "Therefore, Λ°m for weak electrolytes is obtained by using Kohlrausch law of independent migration of ions (Example 3.8).", "fibs": ["Λ°m"]}
{"text": "At any concentration c, if α is the degree of dissociation then it can be approximated to the ratio of molar conductivity Λm at the concentration c to limiting molar conductivity,Λ°m .", "fibs": ["concentration"]}
{"text": "Thus we have:
                                                                                              (3.26)
But we know that for a weak electrolyte like acetic acid (Class XI, Unit 7),
                                         (3.27)
Applications of Kohlrausch law

Using Kohlrausch law of independent migration of ions, it is possible to calculateΛ0m for any electrolyte from the λo of individual ions.", "fibs": ["electrolyte"]}
{"text": "Moreover, for weak electrolytes like acetic acid it is possible to determine the value of its dissociation constant once we know the Λ°m and Λm at a given concentration c.

Example 3.7

Calculate Λ°m for CaCl2 and MgSO4 from the data given in Table 3.4.", "fibs": ["acid"]}
{"text": "Solution
We know from Kohlrausch law that
 = = 119.0 S cm2­­­­ mol–1 + 2(76.3) S cm2­­­­ mol–1
= (119.0 + 152.6) S cm2­­­­ mol–1
= 271.6 S cm2­­­­ mol–1
 = = 106.0 S cm2­­­­ mol–1 + 160.0 S cm2­­­­ mol–1
= 266 S cm2­­­­ mol–1 .", "fibs": ["law"]}
{"text": "Example 3.8
Λ°m for NaCl, HCl and NaAc are 126.4, 425.9 and 91.0 S cm2­­­­ mol–1 respectively.", "fibs": ["Example"]}
{"text": "Calculate Λ°m for HAc.", "fibs": ["Λ°m"]}
{"text": "Solution
 = 
= 
= (425.9 + 91.0 – 126.4 ) S cm2­­­­ mol –1
= 390.5 S cm2­­­­ mol–1 .", "fibs": ["=("]}
{"text": "Example 3.9
The conductivity of 0.001028 mol L–1 acetic acid is 4.95 ×10–5 S cm–1.", "fibs": ["Example"]}
{"text": "Calculate its dissociation constant if Λ°m for acetic acid is 390.5 S cm2­­­­ mol–1.", "fibs": ["dissociation"]}
{"text": "Solution
 =  = 48.15 S cm3 mol–1
α =  = 0.1233

k =  = 1.78 × 10–5 mol L–1


Intext Questions


3.7 Why does the conductivity of a solution decrease with dilution?", "fibs": ["cm3"]}
{"text": "3.8 Suggest a way to determine the Λ°m value of water.", "fibs": ["way"]}
{"text": "3.9 The molar conductivity of 0.025 mol L–1 methanoic acid is 46.1 S cm2 mol–1.", "fibs": ["molar"]}
{"text": "Calculate its degree of dissociation and dissociation constant.", "fibs": ["degree"]}
{"text": "Given λ°(H+) = 349.6 S cm2 mol–1 and λ° (HCOO–) = 54.6 S cm2 
mol–1.", "fibs": ["λ°(H"]}
{"text": "3.5 Electrolytic Cells and Electrolysis

In an electrolytic cell external source of voltage is used to bring about a chemical reaction.", "fibs": ["cell"]}
{"text": "The electrochemical processes are of great importance in the laboratory and the chemical industry.", "fibs": ["importance"]}
{"text": "One of the simplest electrolytic cell consists of two copper strips dipping in an aqueous solution of copper sulphate.", "fibs": ["cell"]}
{"text": "If a DC voltage is applied to the two electrodes, then Cu 2+ ions discharge at the cathode (negatively charged) and the following reaction takes place:




Cu2+(aq) + 2e– → Cu (s)                                                                       (3.28)
Copper metal is deposited on the cathode.", "fibs": ["DC"]}
{"text": "At the anode, copper is converted into Cu2+ ions by the reaction:
Cu(s) → Cu2+(s) + 2e–                                                                                             (3.29)




Thus copper is dissolved (oxidised) at anode and deposited (reduced) at cathode.", "fibs": ["anode"]}
{"text": "This is the basis for an industrial process in which impure copper is converted into copper of high purity.", "fibs": ["basis"]}
{"text": "The impure copper is made an anode that dissolves on passing current and pure copper is deposited at the cathode.", "fibs": ["copper"]}
{"text": "are produced on large scale by electrochemical reduction of their respective cations where no suitable chemical reducing agents are available for this purpose.", "fibs": ["scale"]}
{"text": "Sodium and magnesium metals are produced by the electrolysis of their fused chlorides and aluminium is produced (Class XII, Unit 6) by electrolysis of aluminium oxide in presence of cryolite.", "fibs": ["Sodium"]}
{"text": "Quantitative Aspects of Electrolysis
Michael Faraday was the first scientist who described the quantitative aspects of electrolysis.", "fibs": ["scientist"]}
{"text": "Now Faraday’s laws also flow from what has been discussed earlier.", "fibs": ["’"]}
{"text": "Faraday’s Laws of Electrolysis
After his extensive investigations on electrolysis of solutions and melts of electrolytes, Faraday published his results during 1833-34 in the form of the following well known Faraday’s two laws of electrolysis:
(i) First Law: The amount of chemical reaction which occurs at any electrode during electrolysis by a current is proportional to the quantity of electricity passed through the electrolyte (solution or melt).", "fibs": ["’"]}
{"text": "(ii) Second Law: The amounts of different substances liberated by the same quantity of electricity passing through the electrolytic solution are proportional to their chemical equivalent weights (Atomic Mass of Metal ÷ Number of electrons required to reduce the cation).", "fibs": ["ii"]}
{"text": "There were no constant current sources available during Faraday’s times.", "fibs": ["’"]}
{"text": "The general practice was to put a coulometer (a standard electrolytic cell) for determining the quantity of electricity passed from the amount of metal (generally silver or copper) deposited or consumed.", "fibs": ["practice"]}
{"text": "However, coulometers are now obsolete and we now have constant current (I) sources available and the quantity of electricity Q, passed is given by
Q = It
Q is in coloumbs when I is in ampere and t is in second.", "fibs": ["quantity"]}
{"text": "The amount of electricity (or charge) required for oxidation or reduction depends on the stoichiometry of the electrode reaction.", "fibs": ["amount"]}
{"text": "For example, in the reaction:
Ag +(aq) + e– → Ag(s)                                                                    (3.30)
One mole of the electron is required for the reduction of one mole of silver ions.", "fibs": ["example"]}
{"text": "We know that charge on one electron is equal to 1.6021× 10–19C.", "fibs": ["charge"]}
{"text": "Therefore, the charge on one mole of electrons is equal to:
NA × 1.6021 × 10–19 C = 6.02 × 1023 mol–1 × 1.6021 × 10–19
C = 96487 C mol–1
This quantity of electricity is called Faraday and is represented by the symbol F.
For approximate calculations we use 1F ≃ 96500 C mol–1.", "fibs": ["charge"]}
{"text": "For the electrode reactions:
Mg2+(l) + 2e– → Mg(s)                                                                       (3.31)
Al3+(l) + 3e– → Al(s)                                                                           (3.32)

It is obvious that one mole of Mg2+ and Al3+ require 2 mol of electrons (2F) and 3 mol of electrons (3F) respectively.", "fibs": ["electrode"]}
{"text": "The charge passed through the electrolytic cell during electrolysis is equal to the product of current in amperes and time in seconds.", "fibs": ["charge"]}
{"text": "In commercial production of metals, current as high as 50,000 amperes are used that amounts to about 0.518 F per second.", "fibs": ["production"]}
{"text": "Example 3.10
A solution of CuSO4 is electrolysed for 10 minutes with a current of 1.5 amperes.", "fibs": ["Example"]}
{"text": "What is the mass of copper deposited at the cathode?", "fibs": ["mass"]}
{"text": "Solution


t = 600 s charge = current × time = 1.5 A × 600 s = 900 C
According to the reaction:
Cu2+(aq) + 2e– = Cu(s)
We require 2F or 2 × 96487 C to deposit 1 mol or 63 g of Cu.", "fibs": ["t"]}
{"text": "For 900 C, the mass of Cu deposited
= (63 g mol–1 × 900 C)/(2 × 96487 C mol–1) = 0.2938 g.






3.5.1 Products of Electrolysis
Products of electrolysis depend on the nature of material being electrolysed and the type of electrodes being used.", "fibs": ["C"]}
{"text": "If the electrode is inert (e.g., platinum or gold), it does not participate in the chemical reaction and acts only as source or sink for electrons.", "fibs": ["electrode"]}
{"text": "On the other hand, if the electrode is reactive, it participates in the electrode reaction.", "fibs": ["hand"]}
{"text": "Thus, the products of electrolysis may be different for reactive and inert electrodes.The products of electrolysis depend on the different oxidising and reducing species present in the electrolytic cell and their standard electrode potentials.", "fibs": ["electrolysis"]}
{"text": "Moreover, some of the electrochemical processes although feasible, are so slow kinetically that at lower voltages these do not seem to take place and extra potential (called overpotential) has to be applied, which makes such process more difficult to occur.", "fibs": ["place"]}
{"text": "For example, if we use molten NaCl, the products of electrolysis are sodium metal and Cl2 gas.", "fibs": ["example"]}
{"text": "Here we have only one cation (Na+) which is reduced at the cathode (Na+ + e– → Na) and one anion (Cl–) which is oxidised at the anode (Cl– → ½Cl2 + e– ) .", "fibs": ["cation"]}
{"text": "During the electrolysis of aqueous sodium chloride solution, the products are NaOH, Cl2 and H2.", "fibs": ["electrolysis"]}
{"text": "In this case besides Na+ and Cl– ions we also have H+ and OH– ions along with the solvent molecules, H2O.", "fibs": ["case"]}
{"text": "At the cathode there is competition between the following reduction reactions:
Na+ (aq) + e– → Na (s)                      EƟ(cell)= – 2.71 V
H+ (aq) + e– → ½ H2 (g)                    EƟ(cell)= 0.00 V
The reaction with higher value of EƟ is preferred and therefore, the reaction at the cathode during electrolysis is:
H+ (aq) + e– → ½ H2 (g)                                                                           (3.33)
but H+ (aq) is produced by the dissociation of H2O, i.e.,
H2O (l) → H+ (aq) + OH– (aq)                                                                   (3.34)
Therefore, the net reaction at the cathode may be written as the sum of (3.33) and (3.34) and we have
H2O (l) + e– → ½H2(g) + OH–                                                                   (3.35)
At the anode the following oxidation reactions are possible:
Cl– (aq) → ½ Cl2 (g) + e–                            EƟ(cell)= 1.36 V                          (3.36)
2H2O (l) → O2 (g) + 4H+(aq) + 4e–         EƟ(cell)= 1.23 V                          (3.37)
The reaction at anode with lower value of EƟ is preferred and therefore, water should get oxidised in preference to Cl– (aq).", "fibs": ["cathode"]}
{"text": "However, on account of overpotential of oxygen, reaction (3.36) is preferred.", "fibs": ["account"]}
{"text": "Thus, the net reactions may be summarised as:
NaCl (aq)  Na+ (aq) + Cl– (aq)
Cathode:        H2O(l) + e– → ½ H2(g) + OH– (aq)
Anode:          Cl– (aq) → ½ Cl2(g) + e–
Net reaction:
NaCl(aq) + H2O(l) → Na+(aq) + OH–(aq) + ½H2(g) + ½Cl2(g)
The standard electrode potentials are replaced by electrode potentials given by Nernst equation (Eq.", "fibs": ["NaCl"]}
{"text": "3.8) to take into account the concentration effects.", "fibs": ["3.8)"]}
{"text": "During the electrolysis of sulphuric acid, the following processes are possible at the anode:
2H2O(l) → O2(g) + 4H+(aq) + 4e–                      EƟ(cell)= +1.23 V             (3.38)
2SO42– (aq) → S2O82– (aq) + 2e–                 EƟ(cell) = 1.96 V              (3.39)

For dilute sulphuric acid, reaction (3.38) is preferred but at higher concentrations of H2SO4, reaction (3.39) is preferred.", "fibs": ["electrolysis"]}
{"text": "Intext Questions



3.10 If a current of 0.5 ampere flows through a metallic wire for 2 hours, then how many electrons would flow through the wire?", "fibs": ["ampere"]}
{"text": "3.11 Suggest a list of metals that are extracted electrolytically.", "fibs": ["list"]}
{"text": "3.12 Consider the reaction: Cr2O72– + 14H+ + 6e– → 2Cr3+ + 7H2O
What is the quantity of electricity in coulombs needed to reduce 1 mol of Cr2O72–?", "fibs": ["reaction"]}
{"text": "3.6 Batteries
Any battery (actually it may have one or more than one cell connected in series) or cell that we use as a source of electrical energy is basically a galvanic cell where the chemical energy of the redox reaction is converted into electrical energy.", "fibs": ["battery"]}
{"text": "However, for a battery to be of practical use it should be reasonably light, compact and its voltage should not vary appreciably during its use.", "fibs": ["battery"]}
{"text": "3.6.1 Primary Batteries
In the primary batteries, the reaction occurs only once and after use over a period of time battery becomes dead and cannot be reused again.", "fibs": ["reaction"]}
{"text": "The most familiar example of this type is the dry cell (known as Leclanche cell after its discoverer) which is used commonly in our transistors and clocks.", "fibs": ["example"]}
{"text": "The cell consists of a zinc container that also acts as anode and the cathode is a carbon (graphite) rod surrounded by powdered manganese dioxide and carbon (Fig.3.8).", "fibs": ["cell"]}
{"text": "The space between the electrodes is filled by a moist paste of ammonium chloride (NH4Cl) and zinc chloride (ZnCl2).", "fibs": ["space"]}
{"text": "The electrode reactions are complex, but they can be written approximately as follows :
Anode: Zn(s) → Zn2+ + 2e–

Cathode: MnO2+ NH4++ e–→ MnO(OH) + NH3


Fig.", "fibs": ["electrode"]}
{"text": "3.8: A commercial dry cell consists of a graphite (carbon) cathode in a zinc container; the latter acts as the anode.", "fibs": ["cell"]}
{"text": "In the reaction at cathode, manganese is reduced from the + 4 oxidation state to the +3 state.", "fibs": ["reaction"]}
{"text": "Ammonia produced in the reaction forms a complex with Zn2+ to give [Zn (NH3)4]2+.", "fibs": ["Ammonia"]}
{"text": "The cell has a potential of nearly 1.5 V.

Mercury cell, (Fig.", "fibs": ["cell"]}
{"text": "3.9) suitable for low current devices like hearing aids, watches, etc.", "fibs": ["hearing"]}
{"text": "consists of zinc – mercury amalgam as anode and a paste of HgO and carbon as the cathode.", "fibs": ["zinc"]}
{"text": "The electrolyte is a paste of KOH and ZnO.", "fibs": ["electrolyte"]}
{"text": "The electrode reactions for the cell are given below:
Anode: Zn(Hg) + 2OH– → ZnO(s) + H2O + 2e–

Cathode: HgO + H2O + 2e– → Hg(l) + 2OH–







Fig.", "fibs": ["electrode"]}
{"text": "3.9 Commonly used mercury cell.", "fibs": ["mercury"]}
{"text": "The reducing agent is zinc and the oxidising agent is mercury (II) oxide.", "fibs": ["agent"]}
{"text": "The overall reaction is represented by
Zn(Hg) + HgO(s) → ZnO(s) + Hg(l)
The cell potential is approximately 1.35 V and remains constant during its life as the overall reaction does not involve any ion in solution whose concentration can change during its life time.", "fibs": ["reaction"]}
{"text": "3.6.2 Secondary Batteries

A secondary cell after use can be recharged by passing current through it in the opposite direction so that it can be used again.", "fibs": ["cell"]}
{"text": "A good secondary cell can undergo a large number of discharging and charging cycles.", "fibs": ["cell"]}
{"text": "The most important secondary cell is the lead storage battery (Fig.", "fibs": ["cell"]}
{"text": "It consists of a lead anode and a grid of lead packed with lead dioxide (PbO2 ) as cathode.", "fibs": ["anode"]}
{"text": "A 38% solution of sulphuric acid is used as an electrolyte.", "fibs": ["solution"]}
{"text": "The cell reactions when the battery is in use are given below:
Anode: Pb(s) + SO42–(aq) → PbSO4(s) + 2e–
Cathode: PbO2(s) + SO42–(aq) + 4H+(aq) + 2e– → PbSO4 (s) + 2H2O (l)
i.e., overall cell reaction consisting of cathode and anode reactions is:

Pb(s) + PbO2(s) + 2H2SO4(aq) → 2PbSO4(s) + 2H2O(l)
On charging the battery the reaction is reversed and PbSO4(s) on anode and cathode is converted into Pb and PbO2, respectively.", "fibs": ["cell"]}
{"text": "Fig.", "fibs": ["Fig"]}
{"text": "3.10: The Lead storage battery



Fig.", "fibs": ["storage"]}
{"text": "3.11 A rechargeable nickel-cadmium cell in a jelly roll arrangement and separated by a layer soaked in moist sodium or potassium hydroxide.", "fibs": ["cell"]}
{"text": "Another important secondary cell is the nickel-cadmium cell (Fig.", "fibs": ["cell"]}
{"text": "3.11) which has longer life than the lead storage cell but more expensive to manufacture.", "fibs": ["life"]}
{"text": "We shall not go into details of working of the cell and the electrode reactions during charging and discharging.", "fibs": ["cell"]}
{"text": "The overall reaction during discharge is:
                

Cd (s) + 2Ni(OH)3 (s) → CdO (s) + 2Ni(OH)2 (s) + H2O (l)
3.7 Fuel Cells
Production of electricity by thermal plants is not a very efficient method and is a major source of pollution.", "fibs": ["reaction"]}
{"text": "In such plants, the chemical energy (heat of combustion) of fossil fuels (coal, gas or oil) is first used for converting water into high pressure steam.", "fibs": ["chemical"]}
{"text": "This is then used to run a turbine to produce electricity.", "fibs": ["turbine"]}
{"text": "We know that a galvanic cell directly converts chemical energy into electricity and is highly efficient.", "fibs": ["cell"]}
{"text": "It is now possible to make such cells in which reactants are fed continuously to the electrodes and products are removed continuously from the electrolyte compartment.", "fibs": ["electrolyte"]}
{"text": "Galvanic cells that are designed to convert the energy of combustion of fuels like hydrogen, methane, methanol, etc.", "fibs": ["energy"]}
{"text": "directly into electrical energy are called fuel cells.", "fibs": ["energy"]}
{"text": "Fig.", "fibs": ["Fig"]}
{"text": "3.12:Fuel cell using H2 and O2 produces electricity.", "fibs": ["cell"]}
{"text": "One of the most successful fuel cells uses the reaction of hydrogen with oxygen to form water (Fig.", "fibs": ["fuel"]}
{"text": "The cell was used for providing electrical power in the Apollo space programme.", "fibs": ["cell"]}
{"text": "The water vapours produced during the reaction were condensed and added to the drinking water supply for the astronauts.", "fibs": ["water"]}
{"text": "In the cell, hydrogen and oxygen are bubbled through porous carbon electrodes into concentrated aqueous sodium hydroxide solution.", "fibs": ["cell"]}
{"text": "Catalysts like finely divided platinum or palladium metal are incorporated into the electrodes for increasing the rate of electrode reactions.", "fibs": ["platinum"]}
{"text": "The electrode reactions are given below:
Cathode: O2(g) + 2H2O(l) + 4e–→ 4OH–(aq)
Anode: 2H2 (g) + 4OH–(aq) → 4H2O(l) + 4e–
Overall reaction being:
2H2(g) + O2(g) → 2H2O(l)

The cell runs continuously as long as the reactants are supplied.", "fibs": ["electrode"]}
{"text": "Fuel cells produce electricity with an efficiency of about 70 % compared to thermal plants whose efficiency is about 40%.", "fibs": ["electricity"]}
{"text": "There has been tremendous progress in the development of new electrode materials, better catalysts and electrolytes for increasing the efficiency of fuel cells.", "fibs": ["progress"]}
{"text": "These have been used in automobiles on an experimental basis.", "fibs": ["basis"]}
{"text": "Fuel cells are pollution free and in view of their future importance, a variety of fuel cells have been fabricated and tried.", "fibs": ["pollution"]}
{"text": "3.8 Corrosion

                Corrosion slowly coats the surfaces of metallic objects with oxides or other salts of the metal.", "fibs": ["Corrosion"]}
{"text": "The rusting of iron, tarnishing of silver, development of green coating on copper and bronze are some of the examples of corrosion.", "fibs": ["iron"]}
{"text": "It causes enormous damage to buildings, bridges, ships and to all objects made of metals especially that of iron.", "fibs": ["damage"]}
{"text": "We lose crores of rupees every year on account of corrosion.", "fibs": ["year"]}
{"text": "Fig.", "fibs": ["Fig"]}
{"text": "3.13: Corrosion of iron in atmosphere

In corrosion, a metal is oxidised by loss of electrons to oxygen and formation of oxides.", "fibs": ["iron"]}
{"text": "Corrosion of iron (commonly known as rusting) occurs in presence of water and air.", "fibs": ["Corrosion"]}
{"text": "The chemistry of corrosion is quite complex but it may be considered essentially as an electrochemical phenomenon.", "fibs": ["chemistry"]}
{"text": "At a particular spot (Fig.", "fibs": ["spot"]}
{"text": "3.13) of an object made of iron, oxidation takes place and that spot behaves as anode and we can write the reaction
Anode: 2 Fe (s) → 2 Fe2+ + 4 e–               
Electrons released at anodic spot move through the metal and go to another spot on the metal and reduce oxygen in the presence of H+ (which is believed to be available from H2CO3 formed due to dissolution of carbon dioxide from air into water.", "fibs": ["object"]}
{"text": "Hydrogen ion in water may also be available due to dissolution of other acidic oxides from the atmosphere).", "fibs": ["Hydrogen"]}
{"text": "This spot behaves as cathode with the reaction
Cathode: O2(g) + 4 H+(aq) + 4 e– → 2 H2O (l)     
The overall reaction being:
2Fe(s) + O2(g) + 4H+(aq) → 2Fe2 +(aq) + 2 H2O (l)        EƟ(cell)=1.67 V

The ferrous ions are further oxidised by atmospheric oxygen to ferric ions which come out as rust in the form of hydrated ferric oxide (Fe2O3.", "fibs": ["spot"]}
{"text": "x H2O) and with further production of hydrogen ions.", "fibs": ["x"]}
{"text": "Prevention of corrosion is of prime importance.", "fibs": ["corrosion"]}
{"text": "It not only saves money but also helps in preventing accidents such as a bridge collapse or failure of a key component due to corrosion.", "fibs": ["money"]}
{"text": "One of the simplest methods of preventing corrosion is to prevent the surface of the metallic object to come in contact with atmosphere.", "fibs": ["corrosion"]}
{"text": "This can be done by covering the surface with paint or by some chemicals (e.g.", "fibs": ["surface"]}
{"text": "bisphenol).", "fibs": ["bisphenol"]}
{"text": "Another simple method is to cover the surface by other metals (Sn, Zn, etc.)", "fibs": ["method"]}
{"text": "that are inert or react to save the object.", "fibs": ["object"]}
{"text": "An electrochemical method is to provide a sacrificial electrode of another metal (like Mg, Zn, etc.)", "fibs": ["method"]}
{"text": "which corrodes itself but saves the object.", "fibs": ["object"]}
{"text": "Intext Questions
3.13 Write the chemistry of recharging the lead storage battery, highlighting all the materials that are involved during recharging.", "fibs": ["chemistry"]}
{"text": "3.14 Suggest two materials other than hydrogen that can be used as fuels in fuel cells.", "fibs": ["hydrogen"]}
{"text": "3.15 Explain how rusting of iron is envisaged as setting up of an electrochemical cell.", "fibs": ["iron"]}
{"text": "The Hydrogen Economy
At present the main source of energy that is driving our economy is fossil fuels such as coal, oil and gas.", "fibs": ["Hydrogen"]}
{"text": "As more people on the planet aspire to improve their standard of living, their energy requirement will increase.", "fibs": ["planet"]}
{"text": "In fact, the per capita consumption of energy used is a measure of development.", "fibs": ["fact"]}
{"text": "Of course, it is assumed that energy is used for productive purpose and not merely wasted.", "fibs": ["course"]}
{"text": "We are already aware that carbon dioxide produced by the combustion of fossil fuels is resulting in the ‘Greenhouse Effect’.", "fibs": ["carbon"]}
{"text": "This is leading to a rise in the temperature of the Earth’s surface, causing polar ice to melt and ocean levels to rise.", "fibs": ["rise"]}
{"text": "This will flood low-lying areas along the coast and some island nations such as Maldives face total submergence.", "fibs": ["flood"]}
{"text": "In order to avoid such a catastrope, we need to limit our use of carbonaceous fuels.", "fibs": ["order"]}
{"text": "Hydrogen provides an ideal alternative as its combustion results in water only.", "fibs": ["Hydrogen"]}
{"text": "Hydrogen production must come from splitting water using solar energy.", "fibs": ["Hydrogen"]}
{"text": "Therefore, hydrogen can be used as a renewable and non polluting source of energy.", "fibs": ["hydrogen"]}
{"text": "This is the vision of the Hydrogen Economy.", "fibs": ["vision"]}
{"text": "Both the production of hydrogen by electrolysis of water and hydrogen combustion in a fuel cell will be important in the future.", "fibs": ["production"]}
{"text": "Summary
An electrochemical cell consists of two metallic electrodes dipping in electrolytic solution(s).", "fibs": ["cell"]}
{"text": "Thus an important component of the electrochemical cell is the ionic conductor or electrolyte.", "fibs": ["component"]}
{"text": "In galvanic cell, thechemical energy of a spontaneous redox reaction is converted into electrical work, whereas in an electrolytic cell, electrical energy is used to carry out a non-spontaneous redox reaction.", "fibs": ["cell"]}
{"text": "The standard electrode potential for any electrode dipping in an appropriate solution is defined with respect to standard electrode potential of hydrogen electrode taken as zero.", "fibs": ["electrode"]}
{"text": "The standard potential of the cell can be obtained by taking the difference of the standard potentials of cathode and anode (EƟ(cell)= EƟcathode – EƟanode).", "fibs": ["cell"]}
{"text": "The standard potential of the cells are related to standard Gibbs energy (∆rGƟ = –nFEƟ(cell)) and equilibrium constant(∆rGƟ = – RT ln K) of the reaction taking place in the cell.", "fibs": ["energy"]}
{"text": "Concentration dependence of the potentials of the electrodes and the cells are given by Nernst equation.", "fibs": ["Concentration"]}
{"text": "The conductivity, κ, of an electrolytic solution depends on the concentration of the electrolyte, nature of solvent and temperature.", "fibs": ["conductivity"]}
{"text": "Molar conductivity, Λm, is defined by = κ/c where c is the concentration.", "fibs": ["Molar"]}
{"text": "Conductivity decreases but molar conductivity increases with decrease in concentration.", "fibs": ["Conductivity"]}
{"text": "It increases slowly with decrease in concentration for strong electrolytes while the increase is very steep for weak electrolytes in very dilute solutions.", "fibs": ["decrease"]}
{"text": "Kohlrausch found that molar conductivity at infinite dilution, for an electrolyte is sum of the contribution of the molar conductivity of the ions in which it dissociates.", "fibs": ["molar"]}
{"text": "It is known as law of independent migration of ions and has many applications.", "fibs": ["law"]}
{"text": "Ions conduct electricity through the solution but oxidation and reduction of the ions take place at the electrodes in an electrochemical cell.", "fibs": ["conduct"]}
{"text": "Batteries and fuel cells are very useful forms of galvanic cell.", "fibs": ["fuel"]}
{"text": "Corrosion of metals is essentially an electrochemical phenomenon.", "fibs": ["Corrosion"]}
{"text": "Electrochemical principles are relevant to the Hydrogen Economy.", "fibs": ["Hydrogen"]}
{"text": "Exercise
3.1 Arrange the following metals in the order in which they displace each other from the solution of their salts.", "fibs": ["Exercise"]}
{"text": "3.2 Given the standard electrode potentials,
K+/K = –2.93V, Ag+/Ag = 0.80V,
Hg2+/Hg = 0.79V
Mg2+/Mg = –2.37 V, Cr3+/Cr = – 0.74V
Arrange these metals in their increasing order of reducing power.", "fibs": ["electrode"]}
{"text": "3.3 Depict the galvanic cell in which the reaction
Zn(s)+2Ag+­­­(aq) →Zn2+(aq)+2Ag(s) takes place.", "fibs": ["cell"]}
{"text": "Further show:
(i) Which of the electrode is negatively charged?", "fibs": ["show"]}
{"text": "(ii) The carriers of the current in the cell.", "fibs": ["ii"]}
{"text": "(iii) Individual reaction at each electrode.", "fibs": ["iii"]}
{"text": "3.4 Calculate the standard cell potentials of galvanic cell in which the following reactions take place:
(i) 2Cr(s) + 3Cd2+(aq) → 2Cr3+(aq) + 3Cd
(ii) Fe2+(aq) + Ag+(aq) → Fe3+(aq) + Ag(s)
Calculate the ∆rGƟ and equilibrium constant of the reactions.", "fibs": ["cell"]}
{"text": "3.5 Write the Nernst equation and emf of the following cells at 298 K:
(i) Mg(s) | Mg2+(0.001M) || Cu2+(0.0001 M) | Cu(s)
(ii) Fe(s) | Fe2+(0.001M) || H+(1M)|H2(g)(1bar) | Pt(s)
(iii) Sn(s) | Sn2+(0.050 M) || H+(0.020 M) | H2(g) (1 bar)|Pt(s)
(iv) Pt(s) | Br–(0.010 M)|Br2(l ) || H+(0.030 M) | H2(g) (1 bar)|Pt(s).", "fibs": ["equation"]}
{"text": "3.6 In the button cells widely used in watches and other devices the following reaction takes place:
Zn(s) + Ag2O(s) + H2O(l) → Zn2+(aq) + 2Ag(s) + 2OH–(aq)
Determine ∆r GƟ and EƟ for the reaction.", "fibs": ["button"]}
{"text": "3.7 Define conductivity and molar conductivity for the solution of an electrolyte.", "fibs": ["conductivity"]}
{"text": "Discuss their variation with concentration.", "fibs": ["variation"]}
{"text": "3.8 The conductivity of 0.20 M solution of KCl at 298 K is 0.0248 S cm–1.", "fibs": ["conductivity"]}
{"text": "Calculate its molar conductivity.", "fibs": ["molar"]}
{"text": "3.9 The resistance of a conductivity cell containing 0.001M KCl solution at 298 K is 1500 Ω.", "fibs": ["resistance"]}
{"text": "What is the cell constant if conductivity of 0.001M KCl solution at 298 K is 0.146 × 10–3 S cm–1.", "fibs": ["cell"]}
{"text": "3.10 The conductivity of sodium chloride at 298 K has been determined at different concentrations and the results are given below:
Concentration/M        0.001      0.010        0.020       0.050      0.100
102 × κ/S m–1            1.237       11.85        23.15       55.53     106.74
Calculate  Λm for all concentrations and draw a plot between  Λm and c½.", "fibs": ["conductivity"]}
{"text": "Find the value of .", "fibs": ["value"]}
{"text": "3.11 Conductivity of 0.00241 M acetic acid is 7.896 × 10–5 S cm–1.", "fibs": ["acid"]}
{"text": "Calculate its molar conductivity.", "fibs": ["molar"]}
{"text": "If  for acetic acid is 390.5 S cm2 mol–1, what is its dissociation constant?", "fibs": ["acid"]}
{"text": "3.12 How much charge is required for the following reductions:
(i) 1 mol of Al3+ to Al?", "fibs": ["charge"]}
{"text": "(ii) 1 mol of Cu2+ to Cu?", "fibs": ["ii"]}
{"text": "(iii) 1 mol of MnO4– to Mn2+?", "fibs": ["iii"]}
{"text": "3.13 How much electricity in terms of Faraday is required to produce
(i) 20.0 g of Ca from molten CaCl2?", "fibs": ["electricity"]}
{"text": "(ii) 40.0 g of Al from molten Al2O3?", "fibs": ["ii"]}
{"text": "3.14 How much electricity is required in coulomb for the oxidation of
(i) 1 mol of H2O to O2?", "fibs": ["electricity"]}
{"text": "(ii) 1 mol of FeO to Fe2O3?", "fibs": ["ii"]}
{"text": "3.15 A solution of Ni(NO3)2 is electrolysed between platinum electrodes using a current of 5 amperes for 20 minutes.", "fibs": ["solution"]}
{"text": "What mass of Ni is deposited at the cathode?", "fibs": ["mass"]}
{"text": "3.16 Three electrolytic cells A,B,C containing solutions of ZnSO4, AgNO3 and CuSO4, respectively are connected in series.", "fibs": ["ZnSO4"]}
{"text": "A steady current of 1.5 amperes was passed through them until 1.45 g of silver deposited at the cathode of cell B.", "fibs": ["g"]}
{"text": "How long did the current flow?", "fibs": ["flow"]}
{"text": "What mass of copper and zinc were deposited?", "fibs": ["mass"]}
{"text": "3.17 Using the standard electrode potentials given in Table 3.1, predict if the reaction between the following is feasible:
(i) Fe3+(aq) and I–(aq)
(ii) Ag+ (aq) and Cu(s)
(iii) Fe3+ (aq) and Br– (aq)
(iv) Ag(s) and Fe 3+ (aq)
(v) Br2 (aq) and Fe2+ (aq).", "fibs": ["electrode"]}
{"text": "3.18 Predict the products of electrolysis in each of the following:
(i) An aqueous solution of AgNO3 with silver electrodes.", "fibs": ["electrolysis"]}
{"text": "(ii) An aqueous solution of AgNO3 with platinum electrodes.", "fibs": ["ii"]}
{"text": "(iii) A dilute solution of H2SO4 with platinum electrodes.", "fibs": ["iii"]}
{"text": "(iv) An aqueous solution of CuCl2 with platinum electrodes.", "fibs": ["iv"]}
{"text": "Answers to Some Intext Questions
3.5 E(cell) = 0.91 V
3.6 ∆rGƟ =45.54 kJmol–1 , Kc = 9.62 ×107
3.9 0.114, 3.67 ×10–4 mol L–1



Table of Contents


Unit 3


Electrochemistry

Objectives
3.1 Electrochemical Cells

3.2 Galvanic Cells

3.2.1 Measurement of Electrode Potential



3.3 Nernst Equation

3.3.1 Equilibrium Constant from Nernst Equation
3.3.2 Electro-chemical Cell and Gibbs Energy of the Reaction



3.4 Conductance of Electrolytic Solutions

3.4.1 Measurement of the Conductivity of Ionic Solutions
3.4.2 Variation of Conductivity and Molar Conductivity with Concentration



3.5 Electrolytic Cells and Electrolysis

3.5.1 Products of Electrolysis



3.6 Batteries

3.6.1 Primary Batteries
3.6.2 Secondary Batteries


3.7 Fuel Cells
3.8 Corrosion
Summary
Exercise







Landmarks

Cover





        Unit 3
        Electrochemistry", "fibs": ["E(cell"]}

